app/controllers/menus_controller.rb

def new
  @shop = Shop.find(params[:shop_id])
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "2"]]