app/controllers/shops_controller.rb

  def index
    @shops = Shop.all
---
SELECT "shops".* FROM "shops"

  def show
    @shop = Shop.find(params[:id])
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @shop = Shop.new(params[:shop])

    respond_to do |format|
      if @shop.save
---
INSERT INTO "shops" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 18 Sep 2012 11:34:37 UTC +00:00], ["name", "てすと"], ["updated_at", Tue, 18 Sep 2012 11:34:37 UTC +00:00]]